<script setup></script>
<template>
	<div class="faq-accordion">
		<Accordion :activeIndex="0" multiple>
			<AccordionTab header="Как сделать заказ?">
				<p>
					1. Введите свой номер телефона и дождитесь СМС с кодом авторизации. Не
					повторяйте запрос слишком часто: мы можем отправить всего 4 кода за
					день
					<br />
					2. Код из СМС действителен в течение 5 минут. Пожалуйста, подождите
					сообщение в течение этого времени, прежде чем отправлять повторный
					запрос <br />
					3. Если все попытки исчерпаны (4 смс в день), но вы так и не смогли
					пройти авторизацию, обратитесь в службу поддержки. Сразу укажите ваш
					номер телефона в сообщении сотруднику, так мы сможем помочь вам
					гораздо быстрее
				</p>
			</AccordionTab>
			<AccordionTab header="СМС с кодом авторизации">
				<p>
					1. Введите свой номер телефона и дождитесь СМС с кодом авторизации. Не
					повторяйте запрос слишком часто: мы можем отправить всего 4 кода за
					день
					<br />
					2. Код из СМС действителен в течение 5 минут. Пожалуйста, подождите
					сообщение в течение этого времени, прежде чем отправлять повторный
					запрос <br />
					3. Если все попытки исчерпаны (4 смс в день), но вы так и не смогли
					пройти авторизацию, обратитесь в службу поддержки. Сразу укажите ваш
					номер телефона в сообщении сотруднику, так мы сможем помочь вам
					гораздо быстрее
				</p>
			</AccordionTab>
			<AccordionTab header="Как узнать статус моего заказа?">
				<p>
					1. Введите свой номер телефона и дождитесь СМС с кодом авторизации. Не
					повторяйте запрос слишком часто: мы можем отправить всего 4 кода за
					день
					<br />
					2. Код из СМС действителен в течение 5 минут. Пожалуйста, подождите
					сообщение в течение этого времени, прежде чем отправлять повторный
					запрос <br />
					3. Если все попытки исчерпаны (4 смс в день), но вы так и не смогли
					пройти авторизацию, обратитесь в службу поддержки. Сразу укажите ваш
					номер телефона в сообщении сотруднику, так мы сможем помочь вам
					гораздо быстрее
				</p>
			</AccordionTab>
		</Accordion>
	</div>
</template>

<style lang="scss">
.faq-accordion {
	max-width: 590px;

	.p-accordion {
		color: inherit;
	}

	.p-accordion-header {
		font-weight: 500;
		font-size: 16px;
		line-height: 120%;
		border-bottom: 1px solid #d1d1d1;
	}

	.p-accordion-header-link {
		display: flex;
		flex-direction: row-reverse;
		justify-content: space-between;
		align-items: center;
		padding: 20px 0;
		cursor: pointer;

		svg {
			transform: rotate(90deg);
		}
	}
}
</style>
