<script setup>
const accordionData = [
	{
		title: 'Как сделать заказ?',
		content: [
			'1. Введите свой номер телефона и дождитесь СМС с кодом авторизации. Не повторяйте запрос слишком часто: мы можем отправить всего 4 кода за день',
			'2. Код из СМС действителен в течение 5 минут. Пожалуйста, подождите сообщение в течение этого времени, прежде чем отправлять повторный запрос',
			'3. Если все попытки исчерпаны (4 смс в день), но вы так и не смогли пройти авторизацию, обратитесь в службу поддержки. Сразу укажите ваш номер телефона в сообщении сотруднику, так мы сможем помочь вам гораздо быстрее',
		],
	},
	{
		title: 'СМС с кодом авторизации',
		content: [
			'1. Введите свой номер телефона и дождитесь СМС с кодом авторизации. Не повторяйте запрос слишком часто: мы можем отправить всего 4 кода за день',
			'2. Код из СМС действителен в течение 5 минут. Пожалуйста, подождите сообщение в течение этого времени, прежде чем отправлять повторный запрос',
		],
	},
	{
		title: 'Как узнать статус моего заказа?',
		content: [
			'1. Введите свой номер телефона и дождитесь СМС с кодом авторизации. Не повторяйте запрос слишком часто: мы можем отправить всего 4 кода за день',
			'3. Если все попытки исчерпаны (4 смс в день), но вы так и не смогли пройти авторизацию, обратитесь в службу поддержки. Сразу укажите ваш номер телефона в сообщении сотруднику, так мы сможем помочь вам гораздо быстрее',
		],
	},
];
</script>

<template>
	<div class="faq-accordion" ref="accordion">
		<UiAccordionItem
			v-for="(item, i) in accordionData"
			:key="i"
			:title="item.title"
		>
			<p
				v-for="(content, i) in item.content"
				:key="i"
				class="faq-accordion__content"
			>
				{{ content }}
			</p>
		</UiAccordionItem>
	</div>
</template>

<style scoped lang="scss">
.faq-accordion {
	max-width: 590px;
	display: flex;
	flex-direction: column;
}

.faq-accordion__content {
	&:not(:last-child) {
		margin-bottom: 8px;
	}
}
</style>
